app/controllers/articles_controller.rb

INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `user_id`) VALUES ('Con usuario', 'Nuevo articulo con usuario', '2017-11-13 04:09:28', '2017-11-13 04:09:28', 1)
---
  	def create
  		#@article = Article.new(title: params[:article][:title],body: params[:article][:body])
      @article = current_user.articles.new(article_params)
  		if @article.save