app/controllers/myarticles_controller.rb

  def testservice
    puts 'Hellow word'
    @usuario = params[:usuario]
    puts @usuario
    @apellidos = params[:apellidos]
    puts @apellidos[:paterno]
    roles = params[:roles]

    roles.each { |a| puts a }
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def index
    puts form_authenticity_token
    @articles = Article.all
---
SELECT `articles`.* FROM `articles`

  def create
    @user = User.find(1)
    #@article = Article.new(title: params[:title], body: params[:body])
    @article = @user.articles.new(title: params[:title], body: params[:body])

    if !@article.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `articles` (`title`, `body`, `created_at`, `updated_at`, `user_id`) VALUES ('Algebra 1', 'Informacion muy diverida de algebra ...', '2017-12-15 04:05:17', '2017-12-15 04:05:17', 1)