app/controllers/schools_controller.rb

SELECT `schools`.* FROM `schools`
---
	def index
		@schools = School.all

INSERT INTO `schools` (`name`, `address`, `phone`, `creation`, `is_active`, `students_count`, `created_at`, `updated_at`) VALUES ('Maria Teresa', 'Calle Isidro Fabela #300', '55232986', '2018-01-12 03:48:04', 1, 35, '2018-01-12 03:48:04', '2018-01-12 03:48:04')
---
	def create
	    @now = DateTime.now
	    #@article = @user.articles.new(title: params[:title], body: params[:body])
	    @school = School.new(name: params[:name], address: params[:address], phone: params[:phone], creation:@now, is_active: params[:is_active], is_active: params[:students_count])

	    if !@school.save

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 2 LIMIT 1
DELETE FROM `schools` WHERE `schools`.`id` = 2
---
	def destroy
		@school = School.find(params[:id])
		@school.destroy

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 5 LIMIT 1
---
	def show
		@school = School.find(params[:id])

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 5 LIMIT 1
UPDATE `schools` SET `name` = 'Sor Juana Ines', `address` = 'Calle Constituyentes #1000', `phone` = '5523859999', `students_count` = 50, `updated_at` = '2018-01-13 03:50:30' WHERE `schools`.`id` = 5
---
	def update
		@school = School.find(params[:id])
		@school.name = params[:name]
		@school.address = params[:address]
		@school.phone = params[:phone]
		@school.is_active = params[:is_active]
		@school.students_count = params[:students_count]
		if !@school.save