app/controllers/students_controller.rb

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
INSERT INTO `students` (`name`, `last_name`, `is_active`, `age`, `created_at`, `updated_at`, `school_id`) VALUES ('Diego', 'Mendoza', 1, 22, '2018-01-15 03:54:38', '2018-01-15 03:54:38', 1)
---
	def create
		@school = School.find(params[:company])
	    #@school = School.new(name: params[:name], address: params[:address], phone: params[:phone], creation:@now, is_active: params[:is_active], is_active: params[:students_count])
	    @student = @school.students.new(name: params[:name], last_name: params[:last_name], last_name: params[:is_active], age: params[:age])

	    if !@student.save

SELECT `students`.* FROM `students`
---
	def index
		@students = Student.all

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 1 LIMIT 1
---
	def show
		@student = Student.find(params[:id])

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
DELETE FROM `students` WHERE `students`.`id` = 3
---
	def destroy
		@student = Student.find(params[:id])
		@student.destroy

SELECT  `students`.* FROM `students` WHERE `students`.`id` = 3 LIMIT 1
UPDATE `students` SET `name` = 'Maria', `last_name` = 'Sanchez', `age` = 19, `updated_at` = '2018-01-15 04:20:03' WHERE `students`.`id` = 2
---
	def update
		@student = Student.find(params[:id])
		@student.name = params[:name]
		@student.last_name = params[:last_name]
		@student.is_active = params[:is_active]
		@student.age = params[:age]
		if !@student.save

SELECT  `schools`.* FROM `schools` WHERE `schools`.`id` = 1 LIMIT 1
---
	def filterBySchool
		@school = School.find(params[:company])